/*****************************************************************************
File name: peizhi
Description: 配置测试
Author: 熊康
Version: V1.0
Date: 2022.4.1
*****************************************************************************/
#include<stdio.h>
#include <C8051F020.H>


void main(){
	int i,j;
	
	/* 启动外部晶体振荡器 OSCXCN = 01100111B */
	/* [6:4] = 110B，晶体振荡；[2:0] = 111B，频率 > 6.7MHz */
	OSCXCN = 0x67;			  
	
	/* 等待晶体振荡器启动 SYSCLK = 2M 调试得延时约1ms */
	for(i = 0; i < 256; i++); 
	
	/* 等待振荡器稳定 等待OSCXCN.1 = 1*/
	while(!(OSCXCN & 0x80));
	
	/* OSCICN = 10001000B [7] = 1 使能时钟丢失检测器；[3] = 1 选择外部振荡器 */
	OSCICN = 0x88;
	
	/*配置*/
	XBR2 |= 0x40; //XBARE交叉开关使能 0100_0000
	XBR0 |= 0x02; //SPI连到端口引脚 0000_0010
	XBR1 |= 0x1E; //T0、T1、/INT0和/INT1分配端口引脚 0001_1110
	P1MDIN |= 0x1F;  //将P1.5、 P1.6 和P1.7配置为模拟输入 0001_1111
	
	WDTCN=0xde;
	WDTCN=0xad;//禁止看门狗
	/*输出矩形波*/
	for(i=0;i<1000;i++){
		P2=0xFF;  	//高电平
		for(j=0;j<3000;j++);
		P2=0x00;		//低电平
		for(j=0;j<3000;j++);
	}
}